Revit 2027 API
DirectContext3DHandleSettings.GetColor Method
 Gets the color of the handle and the associated DirectContext3D graphics.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color GetColor()
Public Function GetColor As Color
public:
Color^ GetColor()
member GetColor : unit -> Color
Return Value
Color
 The color.
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace